app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # hello = "hello, my name is minsoo".to_json
    render json: User.all

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-27 22:00:23.247606"], ["email", "gizmo@gizmo.gizmo"], ["name", "Gizmo"], ["updated_at", "2014-10-27 22:00:23.247606"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = 2  [["email", "xx@xx.xx"], ["updated_at", "2014-10-27 22:26:58.184647"]]
---
  def update
    user = User.find(params[:id])
    user.update!(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = 2
---
  def destroy
    user = User.find(params[:id])
    user.delete